blog/2021/arch-installation-guide.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 17:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Arch 安装指南</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Arch 安装指南</h1>
</header><p>
安装过程整体顺利，没有无法解决的问题，主要参考资料：
</p>

<ol class="org-ol">
<li><a href="https://io-oi.me/tech/hello-arch-linux/">https://io-oi.me/tech/hello-arch-linux/</a></li>
<li><a href="https://wiki.archlinux.org/">https://wiki.archlinux.org/</a></li>
<li>Google</li>
</ol>

<p>
除此之外，还有
<a href="https://python-archinstall.readthedocs.io/en/latest/index.html">archinstall</a>
</p>

<div id="outline-container-初始安装" class="outline-2">
<h2 id="初始安装">初始安装</h2>
<div class="outline-text-2" id="text-初始安装">
</div>
<div id="outline-container-更改-bios 使用-usb-系统启动盘优先启动" class="outline-3">
<h3 id="更改-bios 使用-usb-系统启动盘优先启动">更改 BIOS，使用 USB 系统启动盘优先启动</h3>
<div class="outline-text-3" id="text-更改-bios 使用-usb-系统启动盘优先启动">
<p>
插入制作好的 arch linux USB 启动盘，当前目录下并无
install.txt（详见参考资料 1）。
</p>
</div>
</div>

<div id="outline-container-验证-uefi" class="outline-3">
<h3 id="验证-uefi">验证 UEFI</h3>
<div class="outline-text-3" id="text-验证-uefi">
<p>
<code>ls /sys/firmware/efi/efivars</code> 有输出，说明启动模式为 UEFI。
</p>
</div>
</div>

<div id="outline-container-验证网络" class="outline-3">
<h3 id="验证网络">验证网络</h3>
<div class="outline-text-3" id="text-验证网络">
<p>
<code>ping archlinux.org -c 3</code> 验证网络，0% packet loss 说明网络正常。
</p>
</div>
</div>

<div id="outline-container-更新系统时间" class="outline-3">
<h3 id="更新系统时间">更新系统时间</h3>
<div class="outline-text-3" id="text-更新系统时间">
<p>
<code>timedatectl set-ntp true</code> 更新系统时间，=timedatectl status= 检查无误。
</p>
</div>
</div>

<div id="outline-container-硬盘分区" class="outline-3">
<h3 id="硬盘分区">硬盘分区</h3>
<div class="outline-text-3" id="text-硬盘分区">
<ol class="org-ol">
<li><code>fdisk -l</code> 查看硬盘信息：sdb 119.24g 固态，sda 931.51g 机械</li>
<li><code>fdisk /dev/sdb</code> 固态硬盘分区</li>
</ol>

<p>
进入 fdisk 操作界面后，m 查看命令帮助，p 显示目标硬盘分区，g 新建 GPT
分区表。创建 sdb1 分区，n 创建分区、分区序号、类型起始扇区默认，结束扇区
+256M。修改分区类型为 EFI System，p 确认为 EFI System。创建 sdb2
分区，全部默认。我的安装移除了原系统的 signature。
</p>

<p>
分区结果：
</p>

<pre class="example" id="org1bb2aaf">
Device      Start       End   Sectors  Size Type
/dev/sdb1    2048    526335    524288  256M EFI System
/dev/sdb2  526336 250069646 249543311  119G Linux filesystem
</pre>

<p>
关于是否分配 SWAP
分区的讨论：<a href="https://bbs.archlinuxcn.org/viewtopic.php?id=10472">https://bbs.archlinuxcn.org/viewtopic.php?id=10472</a>
</p>

<p>
机械硬盘 sda 作为挂载硬盘存储文件。
</p>
</div>
</div>

<div id="outline-container-硬盘格式化新建文件系统" class="outline-3">
<h3 id="硬盘格式化新建文件系统">硬盘格式化、新建文件系统</h3>
<div class="outline-text-3" id="text-硬盘格式化新建文件系统">
<pre class="example" id="orge4409ae">
mkfs.fat -F32 /dev/sdb1
mkfs.ext4 /dev/sdb2
mkfs.ext4 /dev/sda
</pre>
</div>
</div>

<div id="outline-container-挂载分区" class="outline-3">
<h3 id="挂载分区">挂载分区</h3>
<div class="outline-text-3" id="text-挂载分区">
<pre class="example" id="org2db79fb">
mount /dev/sdb2 /mnt
mkdir -p /mnt/boot/efi
mount /dev/sdb1 /mnt/boot/efi
</pre>
</div>
</div>

<div id="outline-container-选择镜像源" class="outline-3">
<h3 id="选择镜像源">选择镜像源</h3>
<div class="outline-text-3" id="text-选择镜像源">
<pre class="example" id="orge203cd1">
pacman -Syyy reflector # reflector 能够方便地选择镜像源
reflector -c China -a 6 --sort rate --save /etc/pacman.d/mirrorlist # 这里的 mirrorlist 是 U 盘中的，还是硬盘中的？U 盘中的
pacman -Syyy # y 刷新本地缓存 yyy 强制刷新
</pre>
</div>
</div>

<div id="outline-container-安装基本系统和安装时要用的应用到硬盘" class="outline-3">
<h3 id="安装基本系统和安装时要用的应用到硬盘">安装基本系统和安装时要用的应用到硬盘</h3>
<div class="outline-text-3" id="text-安装基本系统和安装时要用的应用到硬盘">
<pre class="example" id="org84dae0c">
pacstrap -i /mnt base base-devel linux linux-firmware dhcpcd vim
</pre>
</div>
</div>
</div>

<div id="outline-container-配置系统" class="outline-2">
<h2 id="配置系统">配置系统</h2>
<div class="outline-text-2" id="text-配置系统">
</div>
<div id="outline-container-进入硬盘而不在-u-盘" class="outline-3">
<h3 id="进入硬盘而不在-u-盘">进入硬盘，而不在 U 盘</h3>
<div class="outline-text-3" id="text-进入硬盘而不在-u-盘">
<pre class="example" id="orgedd63a0">
arch-chroot /mnt /bin/bash
</pre>
</div>
</div>

<div id="outline-container-生成挂载表" class="outline-3">
<h3 id="生成挂载表">生成挂载表</h3>
<div class="outline-text-3" id="text-生成挂载表">
<pre class="example" id="org4aac709">
genfstab -U -p /mnt &gt;&gt; /mnt/etc/fstab
</pre>

<p>
检查：
</p>

<pre class="example" id="org41b7a07">
cat /mnt/etc/fstab
</pre>
</div>
</div>

<div id="outline-container-时区和语言" class="outline-3">
<h3 id="时区和语言">时区和语言</h3>
<div class="outline-text-3" id="text-时区和语言">
<p>
设置时区：
</p>

<pre class="example" id="orgeb6f842">
ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime
hwclock --systohc --utc
</pre>

<p>
配置系统语言环境:
</p>

<p>
<code>vim /etc/locale.gen</code> 取消注释：
</p>

<pre class="example" id="orgc41755e">
en_US.UTF-8 UTF-8
...
zh_CN.UTF-8 UTF-8
</pre>

<p>
生成配置：
</p>

<pre class="example" id="orgfd54382">
locale-gen
</pre>

<p>
设置本地语言环境:
</p>

<p>
<code>vim /etc/locale.conf</code> 输入：
</p>

<pre class="example" id="org3d0f7b7">
LANG=en_US.UTF-8
</pre>
</div>
</div>

<div id="outline-container-安装引导程序" class="outline-3">
<h3 id="安装引导程序">安装引导程序</h3>
<div class="outline-text-3" id="text-安装引导程序">
<pre class="example" id="org06015a0">
pacman -S grub efibootmgr
grub-install --target=x86_64-efi --bootloader-id=GRUB --efi-directory=/boot/efi
grub-mkconfig -o /boot/grub/grub.cfg
</pre>

<p>
运行 grub
相关操作时，会出现警告：=Warning: os-prober will not be executed to detect other bootable partitions.=。查
arch wiki 后，可以在 /etc/default/grub 中设置
=GRUB_DISABLE_OS_PROBER=false=。
</p>
</div>
</div>

<div id="outline-container-设置主机名" class="outline-3">
<h3 id="设置主机名">设置主机名</h3>
<div class="outline-text-3" id="text-设置主机名">
<pre class="example" id="orgc80b6cb">
echo arch &gt; /etc/hostname
</pre>

<p>
<code>vim /etc/hosts</code> 添加以下内容：
</p>

<pre class="example" id="org45204c0">
127.0.0.1 localhost
::1 localhost
127.0.0.1 arch.localdomain arch
</pre>
</div>
</div>

<div id="outline-container-提前配置网络" class="outline-3">
<h3 id="提前配置网络">提前配置网络</h3>
<div class="outline-text-3" id="text-提前配置网络">
<pre class="example" id="org8b7d43b">
pacman -S networkmanager
systemctl enable NetworkManager
systemctl start NetworkManager
systemctl status NetworkManager # 检查是否运行
</pre>
</div>
</div>

<div id="outline-container-设置-root-密码" class="outline-3">
<h3 id="设置-root-密码">设置 root 密码</h3>
<div class="outline-text-3" id="text-设置-root-密码">
<pre class="example" id="org51d2000">
passwd
</pre>
</div>
</div>

<div id="outline-container-新建普通用户" class="outline-3">
<h3 id="新建普通用户">新建普通用户</h3>
<div class="outline-text-3" id="text-新建普通用户">
<pre class="example" id="orgfe607d3">
useradd -m -g users -G wheel -s /bin/bash archie
</pre>

<p>
设置普通用户密码：
</p>

<pre class="example" id="orga4d45b8">
passwd archie
</pre>

<p>
设置普通用户权限:
</p>

<pre class="example" id="org509b787">
EDITOR=vim visudo
</pre>

<p>
取消注释：
</p>

<pre class="example" id="orgf9efdf7">
## Uncomment to allow members of group wheel to execute any command

%wheel ALL=(ALL) ALL

## Same thing without a password

%wheel ALL=(ALL) NOPASSWD: ALL
</pre>
</div>
</div>
