content/posts/arch-installation-guide.md
+++
title = "Arch 安装指南"
date = 2021-08-20T00:00:00+08:00
lastmod = 2022-03-04T13:48:43+08:00
tags = ["技术", "Archlinux"]
draft = false
+++

安装过程整体顺利，没有无法解决的问题，主要参考资料：

1.  <https://io-oi.me/tech/hello-arch-linux/>
2.  <https://wiki.archlinux.org/>
3.  Google

除此之外，还有
[archinstall](https://python-archinstall.readthedocs.io/en/latest/index.html)


## 初始安装 {#初始安装}


### 更改 BIOS，使用 USB 系统启动盘优先启动 {#更改-bios 使用-usb-系统启动盘优先启动}

插入制作好的 arch linux USB 启动盘，当前目录下并无
install.txt（详见参考资料 1）。


### 验证 UEFI {#验证-uefi}

`ls /sys/firmware/efi/efivars` 有输出，说明启动模式为 UEFI。


### 验证网络 {#验证网络}

`ping archlinux.org -c 3` 验证网络，0% packet loss 说明网络正常。


### 更新系统时间 {#更新系统时间}

`timedatectl set-ntp true` 更新系统时间，=timedatectl status= 检查无误。


### 硬盘分区 {#硬盘分区}

1.  `fdisk -l` 查看硬盘信息：sdb 119.24g 固态，sda 931.51g 机械
2.  `fdisk /dev/sdb` 固态硬盘分区

进入 fdisk 操作界面后，m 查看命令帮助，p 显示目标硬盘分区，g 新建 GPT
分区表。创建 sdb1 分区，n 创建分区、分区序号、类型起始扇区默认，结束扇区
+256M。修改分区类型为 EFI System，p 确认为 EFI System。创建 sdb2
分区，全部默认。我的安装移除了原系统的 signature。

分区结果：

```text
Device      Start       End   Sectors  Size Type
/dev/sdb1    2048    526335    524288  256M EFI System
/dev/sdb2  526336 250069646 249543311  119G Linux filesystem
```

关于是否分配 SWAP
分区的讨论：<https://bbs.archlinuxcn.org/viewtopic.php?id=10472>

机械硬盘 sda 作为挂载硬盘存储文件。


### 硬盘格式化、新建文件系统 {#硬盘格式化新建文件系统}

```text
mkfs.fat -F32 /dev/sdb1
mkfs.ext4 /dev/sdb2
mkfs.ext4 /dev/sda
```


### 挂载分区 {#挂载分区}

```text
mount /dev/sdb2 /mnt
mkdir -p /mnt/boot/efi
mount /dev/sdb1 /mnt/boot/efi
```


### 选择镜像源 {#选择镜像源}

```text
pacman -Syyy reflector # reflector 能够方便地选择镜像源
reflector -c China -a 6 --sort rate --save /etc/pacman.d/mirrorlist # 这里的 mirrorlist 是 U 盘中的，还是硬盘中的？U 盘中的
pacman -Syyy # y 刷新本地缓存 yyy 强制刷新
```


### 安装基本系统和安装时要用的应用到硬盘 {#安装基本系统和安装时要用的应用到硬盘}

```text
pacstrap -i /mnt base base-devel linux linux-firmware dhcpcd vim
```


## 配置系统 {#配置系统}


### 进入硬盘，而不在 U 盘 {#进入硬盘而不在-u-盘}

```text
arch-chroot /mnt /bin/bash
```


### 生成挂载表 {#生成挂载表}

```text
genfstab -U -p /mnt >> /mnt/etc/fstab
```

检查：

```text
cat /mnt/etc/fstab
```


### 时区和语言 {#时区和语言}

设置时区：

```text
ln -sf /usr/share/zoneinfo/Asia/Shanghai /etc/localtime
hwclock --systohc --utc
```

配置系统语言环境:

`vim /etc/locale.gen` 取消注释：

```text
en_US.UTF-8 UTF-8
...
zh_CN.UTF-8 UTF-8
```

生成配置：

```text
locale-gen
```

设置本地语言环境:

`vim /etc/locale.conf` 输入：

```text
LANG=en_US.UTF-8
```


### 安装引导程序 {#安装引导程序}

```text
pacman -S grub efibootmgr
grub-install --target=x86_64-efi --bootloader-id=GRUB --efi-directory=/boot/efi
grub-mkconfig -o /boot/grub/grub.cfg
```

运行 grub
相关操作时，会出现警告：=Warning: os-prober will not be executed to detect other bootable partitions.=。查
arch wiki 后，可以在 /etc/default/grub 中设置
=GRUB_DISABLE_OS_PROBER=false=。


### 设置主机名 {#设置主机名}

```text
echo arch > /etc/hostname
```

`vim /etc/hosts` 添加以下内容：

```text
127.0.0.1 localhost
::1 localhost
127.0.0.1 arch.localdomain arch
```


### 提前配置网络 {#提前配置网络}

```text
pacman -S networkmanager
systemctl enable NetworkManager
systemctl start NetworkManager
systemctl status NetworkManager # 检查是否运行
```


### 设置 root 密码 {#设置-root-密码}

```text
passwd
```


### 新建普通用户 {#新建普通用户}

```text
useradd -m -g users -G wheel -s /bin/bash archie
```

设置普通用户密码：

```text
passwd archie
```

设置普通用户权限:

```text
EDITOR=vim visudo
```

取消注释：

```text
## Uncomment to allow members of group wheel to execute any command

%wheel ALL=(ALL) ALL

## Same thing without a password

%wheel ALL=(ALL) NOPASSWD: ALL
```
