blog/2021/arch-installation-guide.html

<div id="outline-container-返回-u-盘" class="outline-3">
<h3 id="返回-u-盘">返回 U 盘</h3>
<div class="outline-text-3" id="text-返回-u-盘">
<pre class="example" id="org8ccae94">
exit
</pre>
</div>
</div>
</div>

<div id="outline-container-重启系统" class="outline-2">
<h2 id="重启系统">重启系统</h2>
<div class="outline-text-2" id="text-重启系统">
<pre class="example" id="org0d0b4fd">
umount -R /mnt
reboot
</pre>

<p>
开机后改动 BIOS，配置「系统启动」后，拔掉 U 盘。普通用户 archie 登录。
</p>
</div>
</div>

<div id="outline-container-完善系统" class="outline-2">
<h2 id="完善系统">完善系统</h2>
<div class="outline-text-2" id="text-完善系统">
</div>
<div id="outline-container-启动微码更新" class="outline-3">
<h3 id="启动微码更新">启动微码更新</h3>
<div class="outline-text-3" id="text-启动微码更新">
<pre class="example" id="org4e2fc7f">
sudo pacman -S intel-ucode
sudo grub-mkconfig -o /boot/grub/grub.cfg
</pre>
</div>
</div>

<div id="outline-container-完善显卡驱动" class="outline-3">
<h3 id="完善显卡驱动">完善显卡驱动</h3>
<div class="outline-text-3" id="text-完善显卡驱动">
<p>
这一步要在知道自己显卡配置的前提下执行。
</p>
</div>

<div id="outline-container-va-api-or-vdpau" class="outline-4">
<h4 id="va-api-or-vdpau">VA-API or VDPAU</h4>
<div class="outline-text-4" id="text-va-api-or-vdpau">
<pre class="example" id="org22bb0bc">
sudo pacman -S libva-utils vdpauinfo
vainfo
vdpauinfo
</pre>

<pre class="example" id="org838530d">
vainfo: VA-API version: 1.12 (libva 2.12.0) vainfo: Driver
version: Intel iHD driver for Intel(R) Gen Graphics - 21.3.2 ()
vainfo: Supported profile and entrypoints VAProfileNone :
VAEntrypointVideoProc VAProfileNone : VAEntrypointStats
VAProfileMPEG2Simple : VAEntrypointVLD VAProfileMPEG2Simple :
VAEntrypointEncSlice VAProfileMPEG2Main : VAEntrypointVLD
VAProfileMPEG2Main : VAEntrypointEncSlice VAProfileH264Main :
VAEntrypointVLD VAProfileH264Main : VAEntrypointEncSlice
VAProfileH264Main : VAEntrypointFEI VAProfileH264Main :
VAEntrypointEncSliceLP VAProfileH264High : VAEntrypointVLD
VAProfileH264High : VAEntrypointEncSlice VAProfileH264High :
VAEntrypointFEI VAProfileH264High : VAEntrypointEncSliceLP
VAProfileVC1Simple : VAEntrypointVLD VAProfileVC1Main :
VAEntrypointVLD VAProfileVC1Advanced : VAEntrypointVLD
VAProfileJPEGBaseline : VAEntrypointVLD VAProfileJPEGBaseline :
VAEntrypointEncPicture VAProfileH264ConstrainedBaseline:
VAEntrypointVLD VAProfileH264ConstrainedBaseline: VAEntrypointEncSlice
VAProfileH264ConstrainedBaseline: VAEntrypointFEI
VAProfileH264ConstrainedBaseline: VAEntrypointEncSliceLP
VAProfileVP8Version0\_3 : VAEntrypointVLD VAProfileVP8Version0\_3 :
VAEntrypointEncSlice VAProfileHEVCMain : VAEntrypointVLD
VAProfileHEVCMain : VAEntrypointEncSlice VAProfileHEVCMain :
VAEntrypointFEI VAProfileHEVCMain10 : VAEntrypointVLD
VAProfileHEVCMain10 : VAEntrypointEncSlice VAProfileVP9Profile0 :
VAEntrypointVLD VAProfileVP9Profile2 : VAEntrypointVLD

display: :0 screen: 0 Failed to open VDPAU backend
libvdpau\_va\_gl.so: cannot open shared object file: No such file or
directory Error creating VDPAU device: 1
</pre>

<p>
So mine is VA-API, I supposed to install
<a href="https://wiki.archlinux.org/title/Hardware_video_acceleration#:~:text=VA-API%20on%20Radeon%20HD%202000%20and%20newer%20GPUs">libva-mesa-driver</a>.
</p>

<p>
我的两种 GPU：
</p>

<p>
00:02.0 VGA compatible controller: Intel Corporation UHD Graphics 620
(rev 07) 01:00.0 Display controller: Advanced Micro Devices, Inc.
[AMD/ATI] Topaz XT [Radeon R7 M260/M265 / M340/M360 / M440/M445 /
530/535 / 620/625 Mobile] (rev c3)
</p>

<ul class="org-ul">
<li>Radeon R7 M260(Topaz)
<a href="https://en.wikipedia.org/wiki/List_of_AMD_graphics_processing_units#Radeon_R5/R7/R9_M200_series">https://en.wikipedia.org/wiki/List_of_AMD_graphics_processing_units#Radeon_R5/R7/R9_M200_series</a></li>
</ul>

<pre class="example" id="org1396de9">
sudo pacman -S xf86-video-intel intel-media-driver vulkan-intel xf86-video-amdgpu xf86-video-ati mesa-vdpau vulkan-radeon
</pre>

<p>
不推荐安装 =xf86-video-intel=，详见
<a href="https://wiki.archlinux.org/title/Intel_graphics#:~:text=Often%20not%20recommended%2C%20see%20note%20below">Intel
graphics - ArchWiki</a>
</p>

<p>
CPU
的详细信息：<a href="https://en.wikipedia.org/wiki/List_of_Intel_graphics_processing_units#:~:text=38.4-,Core%20i5-8250U,-Core%20i5-8350U">https://en.wikipedia.org/wiki/List_of_Intel_graphics_processing_units#:~:text=38.4-,Core%20i5-8250U,-Core%20i5-8350U</a>
</p>

<p>
HDMI audio:
<a href="https://wiki.archlinux.org/title/ATI#:~:text=HDMI%20audio%20is%20supported">https://wiki.archlinux.org/title/ATI#:~:text=HDMI%20audio%20is%20supported</a>
</p>

<p>
ref:
</p>

<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/title/Hardware_video_acceleration">https://wiki.archlinux.org/title/Hardware_video_acceleration</a></li>
<li><a href="https://wiki.archlinux.org/title/Vulkan">https://wiki.archlinux.org/title/Vulkan</a></li>
<li><a href="https://wiki.archlinux.org/title/Xorg#Driver_installation">https://wiki.archlinux.org/title/Xorg#Driver_installation</a></li>
<li><a href="https://wiki.archlinux.org/title/Hardware_video_acceleration#:~:text=VDPAU%20on%20Radeon%20R300%20and%20newer%20GPUs">https://wiki.archlinux.org/title/Hardware_video_acceleration#:~:text=VDPAU%20on%20Radeon%20R300%20and%20newer%20GPUs</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-安装图形界面" class="outline-3">
<h3 id="安装图形界面">安装图形界面</h3>
<div class="outline-text-3" id="text-安装图形界面">
<pre class="example" id="org5ce9acd">
sudo pacman -S xorg xorg-server xorg-xinit plasma # gnome gnome-extra
# systemctl enable gdm
systemctl enable sddm # for kde(plasma)
</pre>

<p>
桌面环境为 GNOME 时，切换 Wayland 至 Xorg：
</p>

<pre class="example" id="org4945b4e">
sudo vim /etc/gdm/custom.conf
</pre>

<p>
<code>/etc/gdm/custom.conf</code>:
</p>

<pre class="example" id="org48abf68">
[daemon]
# Uncoment the line below to force the login screen to use Xorg
-#WaylandEnable=false
+WaylandEnable=false
</pre>

<p>
重启后，图形界面打开，但无法打开 Gnome Terminal，通过 Ctrl+Alt+F2
进入命令行模式，输入 gnome-terminal 显示：
</p>

<pre class="example" id="org2868638">
# Locale not supported by C library.
# Using the fallback 'C' locale
Unable to init server: Could not connect: Connection refused
# Failed to parse arguments: Cannot open display!
</pre>

<p>
解决：在配置系统语言环境时，选择了 es_US，而不是 en_US。
</p>
</div>
</div>
