content/posts/arch-installation-guide.md


### 返回 U 盘 {#返回-u-盘}

```text
exit
```


## 重启系统 {#重启系统}

```text
umount -R /mnt
reboot
```

开机后改动 BIOS，配置「系统启动」后，拔掉 U 盘。普通用户 archie 登录。


## 完善系统 {#完善系统}


### 启动微码更新 {#启动微码更新}

```text
sudo pacman -S intel-ucode
sudo grub-mkconfig -o /boot/grub/grub.cfg
```


### 完善显卡驱动 {#完善显卡驱动}

这一步要在知道自己显卡配置的前提下执行。


#### VA-API or VDPAU {#va-api-or-vdpau}

```text
sudo pacman -S libva-utils vdpauinfo
vainfo
vdpauinfo
```

```text
vainfo: VA-API version: 1.12 (libva 2.12.0) vainfo: Driver
version: Intel iHD driver for Intel(R) Gen Graphics - 21.3.2 ()
vainfo: Supported profile and entrypoints VAProfileNone :
VAEntrypointVideoProc VAProfileNone : VAEntrypointStats
VAProfileMPEG2Simple : VAEntrypointVLD VAProfileMPEG2Simple :
VAEntrypointEncSlice VAProfileMPEG2Main : VAEntrypointVLD
VAProfileMPEG2Main : VAEntrypointEncSlice VAProfileH264Main :
VAEntrypointVLD VAProfileH264Main : VAEntrypointEncSlice
VAProfileH264Main : VAEntrypointFEI VAProfileH264Main :
VAEntrypointEncSliceLP VAProfileH264High : VAEntrypointVLD
VAProfileH264High : VAEntrypointEncSlice VAProfileH264High :
VAEntrypointFEI VAProfileH264High : VAEntrypointEncSliceLP
VAProfileVC1Simple : VAEntrypointVLD VAProfileVC1Main :
VAEntrypointVLD VAProfileVC1Advanced : VAEntrypointVLD
VAProfileJPEGBaseline : VAEntrypointVLD VAProfileJPEGBaseline :
VAEntrypointEncPicture VAProfileH264ConstrainedBaseline:
VAEntrypointVLD VAProfileH264ConstrainedBaseline: VAEntrypointEncSlice
VAProfileH264ConstrainedBaseline: VAEntrypointFEI
VAProfileH264ConstrainedBaseline: VAEntrypointEncSliceLP
VAProfileVP8Version0\_3 : VAEntrypointVLD VAProfileVP8Version0\_3 :
VAEntrypointEncSlice VAProfileHEVCMain : VAEntrypointVLD
VAProfileHEVCMain : VAEntrypointEncSlice VAProfileHEVCMain :
VAEntrypointFEI VAProfileHEVCMain10 : VAEntrypointVLD
VAProfileHEVCMain10 : VAEntrypointEncSlice VAProfileVP9Profile0 :
VAEntrypointVLD VAProfileVP9Profile2 : VAEntrypointVLD

display: :0 screen: 0 Failed to open VDPAU backend
libvdpau\_va\_gl.so: cannot open shared object file: No such file or
directory Error creating VDPAU device: 1
```

So mine is VA-API, I supposed to install
[libva-mesa-driver](https://wiki.archlinux.org/title/Hardware_video_acceleration#:~:text=VA-API%20on%20Radeon%20HD%202000%20and%20newer%20GPUs).

我的两种 GPU：

00:02.0 VGA compatible controller: Intel Corporation UHD Graphics 620
(rev 07) 01:00.0 Display controller: Advanced Micro Devices, Inc.
[AMD/ATI] Topaz XT [Radeon R7 M260/M265 / M340/M360 / M440/M445 /
530/535 / 620/625 Mobile] (rev c3)

-   Radeon R7 M260(Topaz)
    <https://en.wikipedia.org/wiki/List_of_AMD_graphics_processing_units#Radeon_R5/R7/R9_M200_series>

<!--listend-->

```text
sudo pacman -S xf86-video-intel intel-media-driver vulkan-intel xf86-video-amdgpu xf86-video-ati mesa-vdpau vulkan-radeon
```

不推荐安装 =xf86-video-intel=，详见
[Intel
graphics - ArchWiki](https://wiki.archlinux.org/title/Intel_graphics#:~:text=Often%20not%20recommended%2C%20see%20note%20below)

CPU
的详细信息：<https://en.wikipedia.org/wiki/List_of_Intel_graphics_processing_units#:~:text=38.4-,Core%20i5-8250U,-Core%20i5-8350U>

HDMI audio:
<https://wiki.archlinux.org/title/ATI#:~:text=HDMI%20audio%20is%20supported>

ref:

1.  <https://wiki.archlinux.org/title/Hardware_video_acceleration>
2.  <https://wiki.archlinux.org/title/Vulkan>
3.  <https://wiki.archlinux.org/title/Xorg#Driver_installation>
4.  <https://wiki.archlinux.org/title/Hardware_video_acceleration#:~:text=VDPAU%20on%20Radeon%20R300%20and%20newer%20GPUs>


### 安装图形界面 {#安装图形界面}

```text
sudo pacman -S xorg xorg-server xorg-xinit plasma # gnome gnome-extra
# systemctl enable gdm
systemctl enable sddm # for kde(plasma)
```

桌面环境为 GNOME 时，切换 Wayland 至 Xorg：

```text
sudo vim /etc/gdm/custom.conf
```

`/etc/gdm/custom.conf`:

```text
[daemon]
# Uncoment the line below to force the login screen to use Xorg
-#WaylandEnable=false
+WaylandEnable=false
```

重启后，图形界面打开，但无法打开 Gnome Terminal，通过 Ctrl+Alt+F2
进入命令行模式，输入 gnome-terminal 显示：

```text
# Locale not supported by C library.
# Using the fallback 'C' locale
Unable to init server: Could not connect: Connection refused
# Failed to parse arguments: Cannot open display!
```

解决：在配置系统语言环境时，选择了 es_US，而不是 en_US。
