org/arch-installation-guide.org
**** 开启TRIM
     :PROPERTIES:
     :CUSTOM_ID: 开启trim
     :END:
一定要确认固态硬盘是否支持，否则别用。会导致数据丢失

查看是否支持：=lsblk --discard= 如果输出的 DISC-GRAN 和 DISC-MAX 不为
0，则表明支持。

#+begin_example
  sudo vim /etc/fstab
#+end_example

添加 noatime 和 diacard：

#+begin_example
  # <file system> <dir> <type> <options> <dump> <pass>
  # /dev/sdb2
  UUID=b182ad17-2f74-4bf0-95b6-a42884a4ff79 /          ext4       rw,noatime,discard 0 1

  # /dev/sdb1
  UUID=EF6F-2E0C       /boot/efi  vfat       rw,noatime,discard,fmask=0022,dmask=0022,codepage=437,iocharset=ascii,shortname=mixed,utf8,errors=remount-ro 0 2
#+end_example

**** 更换 I/O  scheduler
     :PROPERTIES:
     :CUSTOM_ID: 更换-io-scheduler
     :END:
#+begin_example
  sudo vim /etc/default/grub
#+end_example

找到 =GRUB_CMDLINE_LINUX_DEFAULT= 这一行，添加 =elevator=noop=:

#+begin_example
  GRUB_CMDLINE_LINUX_DEFAULT="elevator=noop loglevel=3 quiet"
#+end_example

#+begin_example
  sudo grub-mkconfig -o /boot/grub/grub.cfg
#+end_example

**** 迁移高读写文件到 tmpfs
     :PROPERTIES:
     :CUSTOM_ID: 迁移高读写文件到-tmpfs
     :END:
#+begin_example
  sudo vim /etc/fstab
#+end_example

添加以下内容到最后：

#+begin_example
  tmpfs  /tmp    tmpfs   defaults,noatime,mode=1777 0 0
  tmpfs  /var/log    tmpfs   defaults,noatime,mode=1777 0 0
  tmpfs  /var/tmp    tmpfs   defaults,noatime,mode=1777 0 0
#+end_example

将 Google Chrome 的缓存挂载到 /tmp（后因排查
[[https://github.com/tianheg/blog/issues/147][arch linux system freeze
after connecting wifi]] 问题取消挂载）：

#+begin_example
  cd ~/.cache/google-chrome/Default/ && rm -rf Cache && ln -sf /tmp Cache
  cd ~/.cache/google-chrome/Default/ && unlink Cache # 取消 Symbolic Link
#+end_example

*** 检查硬盘状况
    :PROPERTIES:
    :CUSTOM_ID: 检查硬盘状况
    :END:
#+begin_example
  sudo pacman -S hdparm smartmontools
  sudo hdparm -I /dev/sdb
  sudo smartctl -t short /dev/sdb
#+end_example

*** 测试固态硬盘速度
    :PROPERTIES:
    :CUSTOM_ID: 测试固态硬盘速度
    :END:
#+begin_example
  sudo dd if=/dev/zero of=/tmp/test.img bs=1G count=1 oflag=dsync
#+end_example

至此系统完善到此告一段落。

** 其他
   :PROPERTIES:
   :CUSTOM_ID: 其他
   :END:

- [[https://nyac.at/4][在阿里云服务器上安装 Arch Linux]]
