blog/2021/arch-installation-guide.html

<div id="outline-container-ssd-优化" class="outline-3">
<h3 id="ssd-优化">SSD 优化</h3>
<div class="outline-text-3" id="text-ssd-优化">
</div>
<div id="outline-container-开启 trim" class="outline-4">
<h4 id="开启 trim">开启 TRIM</h4>
<div class="outline-text-4" id="text-开启 trim">
<p>
一定要确认固态硬盘是否支持，否则别用。会导致数据丢失
</p>

<p>
查看是否支持：=lsblk &#x2013;discard= 如果输出的 DISC-GRAN 和 DISC-MAX 不为
0，则表明支持。
</p>

<pre class="example" id="orgb995c36">
sudo vim /etc/fstab
</pre>

<p>
添加 noatime 和 diacard：
</p>

<pre class="example" id="orge9dc751">
# &lt;file system&gt; &lt;dir&gt; &lt;type&gt; &lt;options&gt; &lt;dump&gt; &lt;pass&gt;
# /dev/sdb2
UUID=b182ad17-2f74-4bf0-95b6-a42884a4ff79 /          ext4       rw,noatime,discard 0 1

# /dev/sdb1
UUID=EF6F-2E0C       /boot/efi  vfat       rw,noatime,discard,fmask=0022,dmask=0022,codepage=437,iocharset=ascii,shortname=mixed,utf8,errors=remount-ro 0 2
</pre>
</div>
</div>

<div id="outline-container-更换-io-scheduler" class="outline-4">
<h4 id="更换-io-scheduler">更换 I/O  scheduler</h4>
<div class="outline-text-4" id="text-更换-io-scheduler">
<pre class="example" id="org5309933">
sudo vim /etc/default/grub
</pre>

<p>
找到 <code>GRUB_CMDLINE_LINUX_DEFAULT</code> 这一行，添加 <code>elevator=noop</code>:
</p>

<pre class="example" id="org527b28f">
GRUB_CMDLINE_LINUX_DEFAULT="elevator=noop loglevel=3 quiet"
</pre>

<pre class="example" id="org2555234">
sudo grub-mkconfig -o /boot/grub/grub.cfg
</pre>
</div>
</div>

<div id="outline-container-迁移高读写文件到-tmpfs" class="outline-4">
<h4 id="迁移高读写文件到-tmpfs">迁移高读写文件到 tmpfs</h4>
<div class="outline-text-4" id="text-迁移高读写文件到-tmpfs">
<pre class="example" id="orgd9293f9">
sudo vim /etc/fstab
</pre>

<p>
添加以下内容到最后：
</p>

<pre class="example" id="org28e0da9">
tmpfs  /tmp    tmpfs   defaults,noatime,mode=1777 0 0
tmpfs  /var/log    tmpfs   defaults,noatime,mode=1777 0 0
tmpfs  /var/tmp    tmpfs   defaults,noatime,mode=1777 0 0
</pre>

<p>
将 Google Chrome 的缓存挂载到 /tmp（后因排查
<a href="https://github.com/tianheg/blog/issues/147">arch linux system freeze
after connecting wifi</a> 问题取消挂载）：
</p>

<pre class="example" id="orgccd33c4">
cd ~/.cache/google-chrome/Default/ &amp;&amp; rm -rf Cache &amp;&amp; ln -sf /tmp Cache
cd ~/.cache/google-chrome/Default/ &amp;&amp; unlink Cache # 取消 Symbolic Link
</pre>
</div>
</div>
</div>

<div id="outline-container-检查硬盘状况" class="outline-3">
<h3 id="检查硬盘状况">检查硬盘状况</h3>
<div class="outline-text-3" id="text-检查硬盘状况">
<pre class="example" id="orga8f024c">
sudo pacman -S hdparm smartmontools
sudo hdparm -I /dev/sdb
sudo smartctl -t short /dev/sdb
</pre>
</div>
</div>

<div id="outline-container-测试固态硬盘速度" class="outline-3">
<h3 id="测试固态硬盘速度">测试固态硬盘速度</h3>
<div class="outline-text-3" id="text-测试固态硬盘速度">
<pre class="example" id="org4383bcf">
sudo dd if=/dev/zero of=/tmp/test.img bs=1G count=1 oflag=dsync
</pre>

<p>
至此系统完善到此告一段落。
</p>
</div>
</div>
</div>

<div id="outline-container-其他" class="outline-2">
<h2 id="其他">其他</h2>
<div class="outline-text-2" id="text-其他">
<ul class="org-ul">
<li><a href="https://nyac.at/4">在阿里云服务器上安装 Arch Linux</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>