content/posts/arch-installation-guide.md


### SSD 优化 {#ssd-优化}


#### 开启 TRIM {#开启 trim}

一定要确认固态硬盘是否支持，否则别用。会导致数据丢失

查看是否支持：=lsblk --discard= 如果输出的 DISC-GRAN 和 DISC-MAX 不为
0，则表明支持。

```text
sudo vim /etc/fstab
```

添加 noatime 和 diacard：

```text
# <file system> <dir> <type> <options> <dump> <pass>
# /dev/sdb2
UUID=b182ad17-2f74-4bf0-95b6-a42884a4ff79 /          ext4       rw,noatime,discard 0 1

# /dev/sdb1
UUID=EF6F-2E0C       /boot/efi  vfat       rw,noatime,discard,fmask=0022,dmask=0022,codepage=437,iocharset=ascii,shortname=mixed,utf8,errors=remount-ro 0 2
```


#### 更换 I/O  scheduler {#更换-io-scheduler}

```text
sudo vim /etc/default/grub
```

找到 `GRUB_CMDLINE_LINUX_DEFAULT` 这一行，添加 `elevator=noop`:

```text
GRUB_CMDLINE_LINUX_DEFAULT="elevator=noop loglevel=3 quiet"
```

```text
sudo grub-mkconfig -o /boot/grub/grub.cfg
```


#### 迁移高读写文件到 tmpfs {#迁移高读写文件到-tmpfs}

```text
sudo vim /etc/fstab
```

添加以下内容到最后：

```text
tmpfs  /tmp    tmpfs   defaults,noatime,mode=1777 0 0
tmpfs  /var/log    tmpfs   defaults,noatime,mode=1777 0 0
tmpfs  /var/tmp    tmpfs   defaults,noatime,mode=1777 0 0
```

将 Google Chrome 的缓存挂载到 /tmp（后因排查
[arch linux system freeze
after connecting wifi](https://github.com/tianheg/blog/issues/147) 问题取消挂载）：

```text
cd ~/.cache/google-chrome/Default/ && rm -rf Cache && ln -sf /tmp Cache
cd ~/.cache/google-chrome/Default/ && unlink Cache # 取消 Symbolic Link
```


### 检查硬盘状况 {#检查硬盘状况}

```text
sudo pacman -S hdparm smartmontools
sudo hdparm -I /dev/sdb
sudo smartctl -t short /dev/sdb
```


### 测试固态硬盘速度 {#测试固态硬盘速度}

```text
sudo dd if=/dev/zero of=/tmp/test.img bs=1G count=1 oflag=dsync
```

至此系统完善到此告一段落。


## 其他 {#其他}

-   [在阿里云服务器上安装 Arch Linux](https://nyac.at/4)